HalloYang06/PSOC_E84_robot/libraries/components/wifi-host-driver/porting/src/wlan/whd_wlan.c
/*
 * MIT License
 *
 * Copyright (c) 2024 Evlers
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 *
 * Change Logs:
 * Date         Author      Notes
 * 2023-12-28   Evlers      first implementation
 * 2024-03-25   Evlers      add configure the mmcsd card scanning wait time
 * 2024-03-25   Evlers      add the function to initialize WiFi using threads
 * 2024-05-27   Evlers      fix the thread initialization bug and deleted the initialization return value
 * 2024-05-28   Evlers      add support for pin names
 * 2024-07-01   Evlers      add the function to automatically probe sdio cards
 */

#include "rtthread.h"
#include "rtdevice.h"

#include "cybsp.h"
#include "cyhal_sdio.h"

#include "whd.h"
#include "whd_int.h"
#include "whd_wifi_api.h"
#include "whd_buffer_api.h"
#include "whd_resource_api.h"
#include "whd_network_types.h"
#include "wiced_resource.h"

#define DBG_TAG           "whd.wlan"
#define DBG_LVL           DBG_INFO
#include "rtdbg.h"

void m55_sdio_kick_change(void);

#ifdef WHD_SET_COUNTRY_FROM_HOST
RT_STATIC_ASSERT(WHD_COUNTRY_CODE_must_be_2_characters_string, (sizeof(WHD_COUNTRY_CODE) == 3));
#endif /* WHD_SET_COUNTRY_FROM_HOST */

/* WHD interface */
static whd_driver_t whd_driver;
static cyhal_sdio_t cyhal_sdio;
static volatile int g_whd_diag_stage = 0;
static volatile int g_whd_diag_result = 0;
static volatile uint32_t g_whd_diag_flags = 0;
static volatile uint32_t g_whd_diag_extra0 = 0;
static volatile uint32_t g_whd_diag_extra1 = 0;
static volatile int g_whd_resource_diag_stage = 0;
static volatile int g_whd_resource_diag_result = 0;
static volatile uint32_t g_whd_resource_diag_extra0 = 0;
static volatile uint32_t g_whd_resource_diag_extra1 = 0;
volatile uint32_t g_whd_scan_diag_start_calls = 0;
volatile uint32_t g_whd_scan_diag_start_ret = 0;
volatile uint32_t g_whd_scan_diag_callback_calls = 0;
volatile uint32_t g_whd_scan_diag_report_calls = 0;
volatile uint32_t g_whd_scan_diag_done_calls = 0;
volatile uint32_t g_whd_scan_diag_last_status = 0;
volatile uint32_t g_whd_scan_diag_last_ssid_len = 0;
volatile int32_t g_whd_scan_diag_last_rssi = 0;
static whd_init_config_t whd_config =
{
    .thread_priority = CY_WIFI_WHD_THREAD_PRIORITY,
    .thread_stack_size = CY_WIFI_WHD_THREAD_STACK_SIZE,
#ifndef WHD_SET_COUNTRY_FROM_HOST
    .country = WHD_COUNTRY_AUSTRALIA,
#else
    .country = (whd_country_code_t)MK_CNTRY((const uint8_t)WHD_COUNTRY_CODE[0], (const uint8_t)WHD_COUNTRY_CODE[1], (uint16_t)WHD_COUNTRY_CODE_REVISION),
#endif /* WHD_SET_COUNTRY_FROM_HOST */
};
extern whd_resource_source_t resource_ops;
extern struct whd_buffer_funcs whd_buffer_ops;

enum
{
    WHD_DIAG_STAGE_BOOT = 1,
    WHD_DIAG_STAGE_SDIO_PROBE_SEM_CREATED,
    WHD_DIAG_STAGE_SDIO_INIT_START,
    WHD_DIAG_STAGE_SDIO_INIT_DONE,
    WHD_DIAG_STAGE_SDIO_PROBE_WAIT,
    WHD_DIAG_STAGE_SDIO_PROBE_DONE,
    WHD_DIAG_STAGE_WHD_INIT,
    WHD_DIAG_STAGE_SDIO_ATTACH_START,
    WHD_DIAG_STAGE_SDIO_ATTACH_DONE,
    WHD_DIAG_STAGE_WAIT_FS_DONE,
    WHD_DIAG_STAGE_WIFI_ON_START,
    WHD_DIAG_STAGE_WIFI_ON_DONE,
    WHD_DIAG_STAGE_DISABLE_PS_DONE,
    WHD_DIAG_STAGE_ADD_AP_IF_DONE,
    WHD_DIAG_STAGE_EVENTS_REGISTERED,
    WHD_DIAG_STAGE_REGISTER_AP_DONE,
    WHD_DIAG_STAGE_REGISTER_STA_DONE,
    WHD_DIAG_STAGE_SET_STA_MODE_DONE,
    WHD_DIAG_STAGE_READY
};

#define WHD_DIAG_FLAG_HIGH_SPEED      (1UL << 0)
#define WHD_DIAG_FLAG_1BIT_SDIO       (1UL << 1)
#define WHD_DIAG_FLAG_STA_IF          (1UL << 2)
#define WHD_DIAG_FLAG_AP_IF           (1UL << 3)
#define WHD_DIAG_FLAG_STA_REGISTERED  (1UL << 4)
#define WHD_DIAG_FLAG_AP_REGISTERED   (1UL << 5)

#ifndef WHD_BOOT_DELAY_MS
#define WHD_BOOT_DELAY_MS             8000U
#endif

#ifndef WHD_WIFI_ON_RETRY_DELAY_MS
#define WHD_WIFI_ON_RETRY_DELAY_MS    0U
#endif

void whd_diag_mark(int stage, int result)
{
    g_whd_diag_stage = stage;
    g_whd_diag_result = result;
}

void whd_diag_extra(uint32_t extra0, uint32_t extra1)
{
    g_whd_diag_extra0 = extra0;
    g_whd_diag_extra1 = extra1;
}

void whd_resource_diag_mark(int stage, int result)
{
    g_whd_resource_diag_stage = stage;
    g_whd_resource_diag_result = result;
}

void whd_resource_diag_extra(uint32_t extra0, uint32_t extra1)
{
    g_whd_resource_diag_extra0 = extra0;
    g_whd_resource_diag_extra1 = extra1;
}

void whd_wlan_get_diag(int *stage, int *result, uint32_t *flags)
{
    if (stage)
    {
        *stage = g_whd_diag_stage;
    }
    if (result)
    {
        *result = g_whd_diag_result;
    }
    if (flags)
    {
        *flags = g_whd_diag_flags;
    }
}

void whd_wlan_get_diag_extra(uint32_t *extra0, uint32_t *extra1)
{
    if (extra0)
    {
        *extra0 = g_whd_diag_extra0;
    }
    if (extra1)
    {
        *extra1 = g_whd_diag_extra1;
    }
}

int whd_diag_get_stage(void)
{
    return g_whd_diag_stage;
}

struct whd_scan
{
    struct rt_wlan_device *wlan;
    whd_scan_result_t scan_result;
    whd_scan_type_t whd_scan_type;
    rt_sem_t active_sem;
};

struct drv_wifi
{
    struct rt_wlan_device *wlan;
    whd_interface_t whd_itf;
};

static struct drv_wifi wifi_sta, wifi_ap;


/* rt-thread wlan interface */

rt_inline struct drv_wifi *get_drv_wifi(struct rt_wlan_device *wlan)
{
    if (wlan == wifi_sta.wlan)
    {
        return &wifi_sta;
    }

    if (wlan == wifi_ap.wlan)
    {
        return &wifi_ap;
    }

    return RT_NULL;
}

static rt_err_t drv_wlan_init(struct rt_wlan_device *wlan)
{
    return RT_EOK;
}

static rt_err_t drv_wlan_mode(struct rt_wlan_device *wlan, rt_wlan_mode_t mode)
{
    return RT_EOK;
}

