HalloYang06/PSOC_E84_robot/libraries/components/wifi-host-driver/porting/src/wlan/whd_wlan.c
    whd_wifi_get_channel(get_drv_wifi(wlan)->whd_itf, &channel);

    return channel;
}

static rt_country_code_t drv_wlan_get_country(struct rt_wlan_device *wlan)
{
    if (whd_config.country == WHD_COUNTRY_CHINA)
    {
        return RT_COUNTRY_CHINA;
    }
    else
    {
        return RT_COUNTRY_UNKNOWN;
    }
}

static rt_err_t drv_wlan_set_mac(struct rt_wlan_device *wlan, rt_uint8_t mac[])
{
    whd_mac_t whd_mac;

    memcpy(whd_mac.octet, mac, sizeof(whd_mac.octet));

    return whd_wifi_set_mac_address(get_drv_wifi(wlan)->whd_itf, whd_mac);
}

static rt_err_t drv_wlan_get_mac(struct rt_wlan_device *wlan, rt_uint8_t mac[])
{
    rt_err_t ret;
    whd_mac_t whd_mac;

    if (wlan == wifi_ap.wlan)
    {
        if ((ret = whd_wifi_get_mac_address(wifi_sta.whd_itf, &whd_mac)) == WHD_SUCCESS)
        {
            /* AP interface needs to come up with MAC different from STA  */
            if (whd_mac.octet[0] & 0x02)
            {
                whd_mac.octet[0] &= (uint8_t) ~(0x02);
            }
            else
            {
                whd_mac.octet[0] |= 0x02;
            }
        }
    }
    else
    {
        ret = whd_wifi_get_mac_address(get_drv_wifi(wlan)->whd_itf, &whd_mac);
    }

    if (ret == WHD_SUCCESS)
    {
        memcpy(mac, whd_mac.octet, RT_WLAN_BSSID_MAX_LENGTH);
    }

    return ret;
}

static int drv_wlan_recv(struct rt_wlan_device *wlan, void *buff, int len)
{
    return RT_EOK;
}

static int drv_wlan_send(struct rt_wlan_device *wlan, void *buff, int len)
{
    whd_buffer_t buffer;

    /* Determines if a particular interface is ready to transceive ethernet packets */
    if (whd_wifi_is_ready_to_transceive(get_drv_wifi(wlan)->whd_itf) != WHD_SUCCESS)
    {
        return -RT_ERROR;
    }

    /* Creating a transport layer pbuf allows WHD to add link data to the pbuf header */
    if (whd_host_buffer_get(get_drv_wifi(wlan)->whd_itf->whd_driver, &buffer, WHD_NETWORK_TX, len + WHD_LINK_HEADER, 1000) != 0)
    {
        LOG_D("err whd_host_buffer_get failed\n");
        return -RT_ERROR;
    }

    /* Sets the offset of buffer data position
     * It is reserved for whd to write link header data
     */
    whd_buffer_add_remove_at_front(get_drv_wifi(wlan)->whd_itf->whd_driver, &buffer, WHD_LINK_HEADER);

    /* Copy network data to WHD */
    memcpy(whd_buffer_get_current_piece_data_pointer(get_drv_wifi(wlan)->whd_itf->whd_driver, buffer), buff, len);

    /*
     *  This function takes ethernet data from the network stack and queues it for transmission over the wireless network.
     *  The function can be called from any thread context as it is thread safe, however
     *  it must not be called from interrupt context since it might get blocked while waiting
     *  for a lock on the transmit queue.
     */
    whd_network_send_ethernet_data(get_drv_wifi(wlan)->whd_itf, buffer);

    return RT_EOK;
}

static const struct rt_wlan_dev_ops ops =
{
    .wlan_init = drv_wlan_init,
    .wlan_mode = drv_wlan_mode,
    .wlan_scan = drv_wlan_scan,
    .wlan_join = drv_wlan_join,
    .wlan_softap = drv_wlan_softap,
    .wlan_disconnect = drv_wlan_disconnect,
    .wlan_ap_stop = drv_wlan_ap_stop,
    .wlan_ap_deauth = drv_wlan_ap_deauth,
    .wlan_scan_stop = drv_wlan_scan_stop,
    .wlan_get_rssi = drv_wlan_get_rssi,
    .wlan_set_powersave = drv_wlan_set_powersave,
    .wlan_get_powersave = drv_wlan_get_powersave,
    .wlan_cfg_promisc = NULL,
    .wlan_cfg_filter = NULL,
    .wlan_cfg_mgnt_filter = NULL,
    .wlan_set_channel = drv_wlan_set_channel,
    .wlan_get_channel = drv_wlan_get_channel,
    .wlan_set_country = NULL,
    .wlan_get_country = drv_wlan_get_country,
    .wlan_set_mac = drv_wlan_set_mac,
    .wlan_get_mac = drv_wlan_get_mac,
    .wlan_recv = drv_wlan_recv,
    .wlan_send = drv_wlan_send,
};

/*
 * This function takes packets from the radio driver and passes them into the
 * lwIP stack. If the stack is not initialized, or if the lwIP stack does not
 * accept the packet, the packet is freed (dropped). If the packet is of type EAPOL
 * and if the Extensible Authentication Protocol over LAN (EAPOL) handler is registered, the packet will be redirected to the registered
 * handler and should be freed by the EAPOL handler.
 */
void cy_network_process_ethernet_data(whd_interface_t iface, whd_buffer_t buf)
{
    uint16_t ethertype;
    uint8_t *data = whd_buffer_get_current_piece_data_pointer(iface->whd_driver, buf);
    struct rt_wlan_device *wlan = wifi_ap.whd_itf == iface ? wifi_ap.wlan : wifi_sta.wlan;

    #define EAPOL_PACKET_TYPE                        (0x888E)

    if (iface->role == WHD_STA_ROLE)
    {

    }
    else if (iface->role == WHD_AP_ROLE)
    {

    }
    else
    {
        whd_buffer_release(iface->whd_driver, buf, WHD_NETWORK_RX);
        return;
    }

    ethertype = (uint16_t) (data[12] << 8 | data[13]);
    if (ethertype == EAPOL_PACKET_TYPE)
    {
        LOG_D("EAPOL_PACKET_TYPE");
    }
    else
    {
        /* If the interface is not yet set up, drop the packet */
        LOG_D("Send data up to wlan");
        rt_wlan_dev_report_data(wlan, data, whd_buffer_get_current_piece_size(iface->whd_driver, buf));
        whd_buffer_release(iface->whd_driver, buf, WHD_NETWORK_RX);
    }
}

static whd_netif_funcs_t netif_if_ops =
{
    .whd_network_process_ethernet_data = cy_network_process_ethernet_data,
};

/**
 * Event handler prototype definition
 *
 * @param[out] whd_event_header_t : whd event header
 * @param[out] uint8_t*           : event data
 * @param[out] handler_user_data  : semaphore data
 */
void *whd_event_handler(whd_interface_t ifp, const whd_event_header_t *event_header, const uint8_t *event_data, void *user_data)
{
    struct drv_wifi *wifi = (struct drv_wifi *)user_data;

    LOG_D("whd_event_handler, event_type: %u", event_header->event_type);

    switch (event_header->event_type)
    {
        case WLC_E_ASSOC:
        case WLC_E_REASSOC:
            LOG_D("Connected.");
            rt_wlan_dev_indicate_event_handle(wifi->wlan, RT_WLAN_DEV_EVT_CONNECT, RT_NULL);
        break;

