HalloYang06/PSOC_E84_robot/libraries/components/wifi-host-driver/porting/src/wlan/whd_wlan.c
        case WLC_E_LINK:
            if (event_header->reason != 0)
            {
                LOG_D("Disconnected, reason: %u", event_header->reason);
                rt_wlan_dev_indicate_event_handle(wifi->wlan, RT_WLAN_DEV_EVT_DISCONNECT, RT_NULL);
            }
        break;
    }

    return user_data;
}

static void register_whd_events (void)
{
    uint16_t event_index = 0;
    uint32_t event_list[] = { WLC_E_ASSOC, WLC_E_REASSOC, WLC_E_LINK, WLC_E_NONE };
    if (whd_wifi_set_event_handler(wifi_sta.whd_itf, event_list, whd_event_handler, &wifi_sta, &event_index) != WHD_SUCCESS)
    {
        LOG_W("Failed to register the whd event");
    }
}

rt_weak void whd_bt_startup (void)
{
    /* The callback indicates that the hci interface is ready.
     * The user rewrites this function to initialize or configure the Bluetooth protocol stack.
     */
}

static void whd_init_thread (void *parameter)
{
    static struct rt_wlan_device wlan_ap, wlan_sta;
    whd_result_t whd_ret;
    whd_oob_config_t oob_config =
    {
#ifndef CYBSP_USING_PIN_NAME
        .host_oob_pin      = CYBSP_HOST_WAKE_IRQ_PIN,
#else
        .host_oob_pin      = rt_pin_get(CYBSP_HOST_WAKE_IRQ_PIN_NAME),
#endif
        .dev_gpio_sel      = 0,
#ifdef CYBSP_HOST_WAKE_IRQ_EVENT_FALL
        .is_falling_edge   = WHD_TRUE,
#else
        .is_falling_edge   = WHD_FALSE,
#endif
        .intr_priority     = CYBSP_OOB_INTR_PRIORITY
    };
    whd_sdio_config_t whd_sdio_config =
    {
        .sdio_1bit_mode        = WHD_FALSE,
        .high_speed_sdio_clock = WHD_FALSE,
        .oob_config            = oob_config
    };

    wifi_ap.wlan = &wlan_ap;
    wifi_sta.wlan = &wlan_sta;
    whd_diag_mark(WHD_DIAG_STAGE_BOOT, 0);

    /*
     * The CYW55500/CYW55513 combo radio is shared with the CM33 Bluetooth
     * startup path. Give the BT HCI patch window time to finish before CM55
     * downloads WiFi firmware through WHD/SDIO.
     */
    if (WHD_BOOT_DELAY_MS > 0U)
    {
        rt_kprintf("[whd.wlan] boot delay %lu ms before WiFi init\n", (unsigned long)WHD_BOOT_DELAY_MS);
        rt_thread_mdelay(WHD_BOOT_DELAY_MS);
    }

    /* Creates a semaphore to wait probe the sdio card */
    cyhal_sdio.probe = rt_sem_create("sdio probe", 0, RT_IPC_FLAG_PRIO);
    RT_ASSERT(cyhal_sdio.probe != NULL);
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_PROBE_SEM_CREATED, 0);

    /* Register the sdio driver */
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_INIT_START, 0);
    if (cyhal_sdio_init(&cyhal_sdio) != CYHAL_SDIO_RET_NO_ERRORS)
    {
        whd_diag_mark(WHD_DIAG_STAGE_SDIO_INIT_START, -1);
        LOG_E("Unable to register SDIO driver to mmcsd!");
        return;
    }
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_INIT_DONE, 0);

    LOG_D("Wait for sdio card registration..");

    /* Waiting card registration and delete the semaphore */
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_PROBE_WAIT, 0);
    while (rt_sem_take(cyhal_sdio.probe, rt_tick_from_millisecond(500)) != RT_EOK)
    {
        m55_sdio_kick_change();
    }
    rt_sem_delete(cyhal_sdio.probe);
    cyhal_sdio.probe = RT_NULL;
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_PROBE_DONE, 0);

    /* Configure sdio high speed mode and bus width */
    if (cyhal_sdio.card->host->freq_max > 25000000)
    {
        whd_sdio_config.high_speed_sdio_clock = WHD_TRUE;
        g_whd_diag_flags |= WHD_DIAG_FLAG_HIGH_SPEED;
        LOG_D("SDIO high speed mode enabled.");
    }

    if (!(cyhal_sdio.card->host->flags & MMCSD_BUSWIDTH_4))
    {
        whd_sdio_config.sdio_1bit_mode = WHD_TRUE;
        g_whd_diag_flags |= WHD_DIAG_FLAG_1BIT_SDIO;
        LOG_D("SDIO 1 bit mode enabled.");
    }

    /* Initialize WiFi Host Drivers (WHD) */
#ifdef WPRINT_ENABLE_WHD_INFO
    WPRINT_MACRO( ("RT-Thread WiFi Host Drivers (WHD)\n") );
    WPRINT_MACRO( ("You can get the latest version on https://github.com/evlers/rt-thread_wifi-host-driver\n") );
#endif /* WPRINT_ENABLE_WHD_INFO */

    /* Initialize WiFi host drivers */
    whd_diag_mark(WHD_DIAG_STAGE_WHD_INIT, 0);
    whd_init(&whd_driver, &whd_config, &resource_ops, &whd_buffer_ops, &netif_if_ops);

    /* Attach a bus SDIO */
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_ATTACH_START, 0);
    if (whd_bus_sdio_attach(whd_driver, &whd_sdio_config, &cyhal_sdio) != WHD_SUCCESS)
    {
        whd_diag_mark(WHD_DIAG_STAGE_SDIO_ATTACH_START, -1);
        LOG_E("Unable to Attach to the sdio bus!");
        return;
    }
    whd_diag_mark(WHD_DIAG_STAGE_SDIO_ATTACH_DONE, 0);

#ifdef WHD_RESOURCES_IN_EXTERNAL_STORAGE_FS
    LOG_D("Wait mounting the external storage of file system..");
    extern void whd_wait_fs_mount (void);
    whd_wait_fs_mount();
#endif
    whd_diag_mark(WHD_DIAG_STAGE_WAIT_FS_DONE, 0);

    /* Switch on Wifi, download firmware and create a primary interface, returns whd_interface_t */
    whd_diag_mark(WHD_DIAG_STAGE_WIFI_ON_START, 0);
    whd_ret = whd_wifi_on(whd_driver, &wifi_sta.whd_itf);
    if ((whd_ret != WHD_SUCCESS) && (WHD_WIFI_ON_RETRY_DELAY_MS > 0U))
    {
        whd_diag_mark(WHD_DIAG_STAGE_WIFI_ON_START, (int)whd_ret);
        LOG_W("whd_wifi_on failed ret=0x%08lx, retry after %lu ms",
              (unsigned long)whd_ret,
              (unsigned long)WHD_WIFI_ON_RETRY_DELAY_MS);
        rt_thread_mdelay(WHD_WIFI_ON_RETRY_DELAY_MS);
        whd_ret = whd_wifi_on(whd_driver, &wifi_sta.whd_itf);
    }
    if (whd_ret != WHD_SUCCESS)
    {
        if (whd_diag_get_stage() < 1100)
        {
            whd_diag_mark(WHD_DIAG_STAGE_WIFI_ON_START, (int)whd_ret);
        }
        LOG_E("Unable to start the WiFi module, ret=0x%08lx!", (unsigned long)whd_ret);
        return;
    }
    g_whd_diag_flags |= WHD_DIAG_FLAG_STA_IF;
    whd_diag_mark(WHD_DIAG_STAGE_WIFI_ON_DONE, 0);

    /* Bluetooth startup */
    whd_bt_startup();

#ifdef CY_WIFI_DEFAULT_ENABLE_POWERSAVE_MODE
    uint32_t value = 0;
    if (whd_wifi_get_powersave_mode(wifi_sta.whd_itf, &value) != WHD_SUCCESS)
    {
        LOG_E("The powersave mode switch status cannot be get!");
        return;
    }
#endif

    /* Disables 802.11 power save mode on specified interface */
    if (whd_wifi_disable_powersave(wifi_sta.whd_itf) != WHD_SUCCESS)
    {
        whd_diag_mark(WHD_DIAG_STAGE_WIFI_ON_DONE, -2);
        LOG_E("Failed to disable the powersave mode!");
        return;
    }
    whd_diag_mark(WHD_DIAG_STAGE_DISABLE_PS_DONE, 0);

#ifdef CY_WIFI_DEFAULT_ENABLE_POWERSAVE_MODE
    if (value == PM1_POWERSAVE_MODE)
    {
        /* Enables powersave mode on specified interface */
        if (whd_wifi_enable_powersave(wifi_sta.whd_itf) != WHD_SUCCESS)
        {
            LOG_E("Failed to enable the powersave mode!");
            return;
        }

        LOG_D("Enables powersave mode.");
    }
    else if (value == PM2_POWERSAVE_MODE)
    {
        /* Enables powersave mode on specified interface while attempting to maximise throughput */
        /* Note: When working in this mode, sdio communication timeout will occur, which is the normal operation of whd */
        if (whd_wifi_enable_powersave_with_throughput(wifi_sta.whd_itf, CY_WIFI_DEFAULT_PM2_SLEEP_RET_TIME) != WHD_SUCCESS)
        {
            LOG_E("Failed to enable the powersave mode!");
            return;
        }

        LOG_D("Enables powersave mode while attempting to maximise throughput.");
    }
#endif

